---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPattern.EndSpace
source: html/8bddb1cd-e2d2-cace-282e-a261edb41a11.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.EndSpace Property

The extra space added after a whole baluster pattern.

## Syntax (C#)
```csharp
public double EndSpace { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for endSpace must be between 0 and 30000 feet.